#ifndef __CPUID_H__
#define __CPUID_H__

// https://www.cpu-world.com/cgi-bin/CPUID.pl?s=21
// https://en.wikipedia.org/wiki/CPUID
// Intel® Architecture Instruction Set Extensions and Future Features Programming Reference

#include <stdio.h>
#include <stdint.h>

/*
 *
 * https://github.com/jamesstringerparsec/Easy-GPU-PV/issues/226
 * ¿Hay alguna forma de modificar el bit del hipervisor para evitar esas detecciones de VM?
 * Esto es simple en VMware configurando "hypervisor.cpuid.v0 = "FALSE"" en el archivo vmx.
 *
 */
typedef enum flags_mask { // https://en.wikipedia.org/wiki/FLAGS_register
    flags_mask_Carry_flag                = 0x00000001, // flag CF   (Status)   1bit  (bit 0)
    flags_mask_Reserved_EFLAGS           = 0x00000002, // siempre en 1 en EFLAGS    (bit 1)
    flags_mask_Parity_flag               = 0x00000004, // flag PF   (Status)   1bit  (bit 2)
    flags_mask_Reserved1                 = 0x00000008, // (reservada)                (bit 3) https://www.righto.com/2013/02/looking-at-silicon-to-understanding.html
    flags_mask_Auxiliary_Carry_flag      = 0x00000010, // Flag AF   (Status)   1bit  (bit 4)
    flags_mask_Reserved2                 = 0x00000020, // (reservada)                (bit 5) https://www.righto.com/2013/02/looking-at-silicon-to-understanding.html
    flags_mask_Zero_flag                 = 0x00000040, // Flag ZF   (Status)   1bit  (bit 6)
    flags_mask_Sign_flag                 = 0x00000080, // Flag DF   (Status)   1bit  (bit 7)

     * Los formatos de las hojas 40000001h y hasta la hoja más alta admitida son específicos del hipervisor. Los hipervisores que implementan estas hojas 
     * normalmente también configurarán el bit 31 de ECX para la hoja 1 de CPUID para indicar su presencia.
     * 
     * Los hipervisores que exponen más de una interfaz de hipervisor pueden proporcionar conjuntos adicionales de hojas de CPUID para las interfaces 
     * adicionales, con un espaciado de hojas de 100 h por interfaz. Por ejemplo, cuando QEMU está configurado para proporcionar interfaces Hyper-V y 
     * KVM, proporcionará información de Hyper-V a partir de la hoja CPUID 40000000h e información de KVM a partir de la hoja 40000100h.[105][106]
     * 
     */
    CPUID_RESERVED_FOR_HYPERVISOR_USE           = 0x40000000,

    // CPUID extendidos, comprobar con CPUID eax = 0 el valor max de entrada admitido. Si el valor retornado en EAX no es superior, no se puede realizar estos
    // llamados.
    CPUID_INTELEXTENDED                         = 0x80000000,
    CPUID_INTELFEATURES,
    CPUID_INTELBRANDSTRING,
    CPUID_INTELBRANDSTRINGMORE,
    CPUID_INTELBRANDSTRINGEND                   = 0x80000004,
    CPUID_CACHE_HIERARCHY_AND_TOPOLOGY_AMD      = 0x8000000D // Jerarquía y topología de caché (para MAD)
} cpuid_requests;

typedef enum CPUID_Extended_Features_page { // se usa junto a CPUID_Extended_Features, donde este se pasa a EAX, y a ECX un CPUID_Extended_Features_page
    CPUID_Extended_Features_page_1,
    CPUID_Extended_Features_page_2,
    CPUID_Extended_Features_page_3
} CPUID_Extended_Features_page; 
typedef enum CPUID_XSAVE_features_and_state_components_page { 
    CPUID_XSAVE_features_and_state_components_page_1,
    CPUID_XSAVE_features_and_state_components_page_2,
    CPUID_XSAVE_features_and_state_components_page_3
                                                   // se usa junto a CPUID_XSAVE_FEATURES_AND_STATE_COMPONENTS, 
} CPUID_XSAVE_features_and_state_components_page;  // donde este se pasa a EAX, y a ECX un CPUID_XSAVE_features_and_state_components_page
typedef enum CPUID_SGX_capabilities_page { 
    CPUID_SGX_capabilities_page_1,
    CPUID_SGX_capabilities_page_2,
    CPUID_SGX_capabilities_page_3
                                                   // se usa junto a CPUID_SGX_CAPATIBLES, 
} CPUID_SGX_capabilities_page;  // donde este se pasa a EAX, y a ECX un CPUID_SGX_CAPATIBLES
typedef enum CPUID_Processor_Trace_page { 
    CPUID_Processor_Trace_page_1,
    CPUID_Processor_Trace_page_2
                                                   // se usa junto a CPUID_PROCESSOR_TRACE, 
} CPUID_Processor_Trace_page;  // donde este se pasa a EAX, y a ECX un CPUID_PROCESSOR_TRACE
typedef enum CPUID_AVX10_Features_page { 
    CPUID_AVX10_Features_page_1,
    CPUID_AVX10_Features_page_2
                                                   // se usa junto a CPUID_AVX10_FEATURES, 
} CPUID_AVX10_Features_page;  // donde este se pasa a EAX, y a ECX un CPUID_AVX10_FEATURES


#pragma pack(push)
typedef struct manufacturer_ID
{
    uint32_t EBX;
    uint32_t EDX;
    uint32_t ECX;
    uint8_t final_string; // \0
} manufacturer_ID;

typedef struct Processor_Info_and_Feature_Bits {
    uint32_t Stepping_ID        :4; // 3  - 0
    uint32_t Model              :4; // 7  - 4
    uint32_t Family_ID          :4; // 11 - 8
    uint32_t Processor_Type     :2; // 13 - 12
    uint32_t Reserved2          :2; // 15 - 14
    uint32_t Extended_Model_ID  :4; // 19 - 16
    uint32_t Extended_Family_ID :8; // 27 - 20
    uint32_t Reserved1          :4; // 31 - 28
} Processor_Info_and_Feature_Bits;
typedef struct Additional_Information_Feature_Bits { // para CPUID con EAX=1; esta estructura esta en EBX
    uint32_t Brand_Index        :8; // 7  - 0   Descripción: El Brand Index es un identificador único del modelo del procesador.
                                    //          Validez: Siempre válido.
                                    //          Uso: Se utiliza para identificar y diferenciar entre modelos de procesadores de una misma familia.
    uint32_t CLFLUSH            :8; // 15 - 8   tamaño de línea (Valor * 8 = tamaño de línea de caché en bytes)
                                    //          Descripción: Tamaño de la línea de caché para la instrucción CLFLUSH.
                                    //          Validez: Este campo es válido si el bit 19 de CPUID.01.EDX (CLFSH) está establecido en 1.
                                    //          Cálculo: El valor en estos bits multiplicado por 8 da el tamaño de la línea de caché en bytes.
    uint32_t Max_ID_addressable :8; // 23 - 16  Número máximo de ID direccionables para procesadores lógicos en este paquete físico;
                                    //          El entero de potencia de 2 más cercano que no sea menor que este valor es el número 
                                    //          de ID de APIC iniciales únicos reservados para direccionar diferentes procesadores lógicos en un paquete físico.
                                    //          Uso anterior: Número de procesadores lógicos por procesador físico; dos para el 
                                    //          procesador Pentium 4 con tecnología Hyper-Threading.
                                    // En CPU con más de 128 procesadores lógicos en un solo paquete (por ejemplo, 
                                    // Intel Xeon Phi 7290[41] y AMD Threadripper Pro 7995WX[42]), el valor en el bit 23:16 se 
                                    // establece en un valor sin potencia de 2.
                                    //
                                    // Descripcion:
                                    // Concepto Básico;
                                    // Los procesadores modernos pueden ejecutar múltiples hilos de ejecución al mismo tiempo. 
                                    // Esto es posible gracias a tecnologías como el Hyper-Threading de Intel, donde un solo procesador 
                                    // físico puede actuar como si fuera varios procesadores lógicos. Cada uno de estos procesadores lógicos 
                                    // puede ejecutar su propio hilo de ejecución.
                                    // Número Máximo de IDs Direccionables para Procesadores Lógicos
                                    // Imagina que tienes una fábrica con varias líneas de producción. Cada línea de producción puede trabajar en 
                                    // una tarea diferente al mismo tiempo. En nuestro ejemplo, cada línea de producción es como un procesador lógico
                                    // dentro de un procesador físico.
                                    // El "Número máximo de IDs direccionables para procesadores lógicos" es como el número máximo de líneas de 
                                    // producción que puede tener tu fábrica. Este número indica cuántos procesadores lógicos diferentes puede 
                                    // gestionar tu procesador físico.
                                    // El "Número máximo de IDs direccionables para procesadores lógicos" es como el número máximo de líneas de 
                                    // producción que puede tener tu fábrica. Este número indica cuántos procesadores lógicos diferentes puede 
                                    // gestionar tu procesador físico.
                                    // Por Qué es Importante?
                                    // Identificación Única:
                                    // Cada procesador lógico necesita una identificación única para que el sistema operativo y las aplicaciones 
                                    // puedan comunicarse con él de manera efectiva. Es como tener un número de identificación único para cada línea de producción.
                                    // Optimización del Rendimiento:
                                    // Sabiendo cuántos procesadores lógicos puede manejar el procesador físico, el sistema operativo puede optimizar cómo 
                                    // distribuir las tareas entre ellos. Es similar a asignar diferentes tareas a cada línea de producción para aprovechar 
                                    // al máximo la capacidad de la fábrica.
                                    // Configuración del Sistema:
                                    // Esta información ayuda a configurar correctamente el sistema, especialmente en entornos de servidores o estaciones de 
                                    // trabajo donde es crucial aprovechar al máximo los recursos del hardware.
                                    // Ejemplo Simplificado
                                    // Supongamos que tienes un procesador físico que, gracias a Hyper-Threading, puede manejar hasta 8 procesadores lógicos. 
                                    // Esto significa que el sistema operativo puede ver y utilizar hasta 8 procesadores como si fueran independientes, aunque 
                                    // físicamente solo haya uno.
                                    // Procesador Físico: 1
                                    // Procesadores Lógicos: 8
                                    // Número máximo de IDs direccionables: 8
                                    // Este número máximo (8 en nuestro ejemplo) es crucial para entender cuántos hilos de ejecución puedes correr 
                                    // simultáneamente en tu sistema.
                                    // En Resumen
                                    // El "Número máximo de IDs direccionables para procesadores lógicos" es un valor que indica cuántos procesadores 
                                    // lógicos puede manejar un procesador físico. Esto permite que el sistema operativo y las aplicaciones optimicen el uso del 
                                    // hardware, asegurando que las tareas se distribuyan eficientemente entre los distintos procesadores lógicos disponibles.




    uint32_t Local_APIC_ID      :8; //  El ID de APIC local también se puede identificar a través de la hoja cpuid 0Bh 
                                    //  ( CPUID.0Bh.EDX[x2APIC-ID] ). En CPU con más de 256 procesadores lógicos en un paquete 
                                    //  (por ejemplo, Xeon Phi 7290), se debe utilizar la hoja 0Bh porque el ID APIC no cabe en 8 bits.
                                    //  Descripción: ID APIC local del procesador lógico que está ejecutando la instrucción. APIC 
                                    //  (Advanced Programmable Interrupt Controller) es un componente que maneja interrupciones en sistemas multiprocesador
                                    //  El "Local APIC ID" es importante porque permite identificar de forma única cada procesador lógico. En sistemas con 
                                    //  múltiples procesadores, puede haber conflictos o problemas si dos procesadores tienen el mismo identificador de APIC local.
                                    //  El "Local APIC ID" se utiliza en el manejo de interrupciones y en la coordinación de tareas entre los diferentes 
                                    //  procesadores en un sistema multiprocesador. Cada procesador utiliza su identificador de APIC local para comunicarse 
                                    //  con el APIC local y coordinar las interrupciones y otras actividades del sistema.
                                    //  Validez: Válido para procesadores Pentium 4 y posteriores.
                                    // Uso: El APIC-ID inicial se utiliza para identificar el procesador lógico en ejecución.
                                    // resumen: es un identificador único asignado a cada procesador lógico en un sistema multiprocesador 
                                    // y se utiliza para coordinar las actividades del sistema
                                
} Additional_Information_Feature_Bits;


typedef struct cpuid_feat_ecx {
    uint32_t SSE3       :1; // 00
    uint32_t PCLMUL     :1; // 01
    uint32_t DTES64     :1; // 02
    uint32_t MONITOR    :1; // 03
    uint32_t DS_CPL     :1; // 04
    uint32_t VMX        :1; // 05
    uint32_t SMX        :1; // 06
    uint32_t EST        :1; // 07
    uint32_t TM2        :1; // 08
    uint32_t SSSE3      :1; // 09
    uint32_t CID        :1; // 10
    uint32_t SDBG       :1; // 11
    uint32_t FMA        :1; // 12
    uint32_t CX16       :1; // 13
    uint32_t XTPR       :1; // 14
    uint32_t PDCM       :1; // 15
    uint32_t RESERVADO  :1; // 16
    uint32_t PCID       :1; // 17
    uint32_t DCA        :1; // 18
    uint32_t SSE4_1     :1; // 19
    uint32_t SSE4_2     :1; // 20
    uint32_t X2APIC     :1; // 21
    uint32_t MOVBE      :1; // 22
    uint32_t POPCNT     :1; // 23
    uint32_t TSC        :1; // 24
    uint32_t AES        :1; // 25
    uint32_t XSAVE      :1; // 26
    uint32_t OSXSAVE    :1; // 27
    uint32_t AVX        :1; // 28
    uint32_t F16C       :1; // 29
    uint32_t RDRAND     :1; // 30
    uint32_t HYPERVISOR :1; // 31
} cpuid_feat_ecx;

typedef struct cpuid_feat_edx {
    uint32_t FPU        :1; // 00
    uint32_t VME        :1; // 01
    uint32_t DE         :1; // 02
    uint32_t PSE        :1; // 03
    uint32_t TSC        :1; // 04
    uint32_t MSR        :1; // 05
    uint32_t PAE        :1; // 06
    uint32_t MCE        :1; // 07
    uint32_t CX8        :1; // 08
    uint32_t APIC       :1; // 09
    uint32_t RESERVADO  :1; // 10
    uint32_t SEP        :1; // 11
    uint32_t MTRR       :1; // 12
    uint32_t PGE        :1; // 13
    uint32_t MCA        :1; // 14
    uint32_t CMOV       :1; // 15
    uint32_t PAT        :1; // 16
    uint32_t PSE36      :1; // 17
    uint32_t PSN        :1; // 18
    uint32_t CLFLUSH    :1; // 19
    uint32_t NX         :1; // 20
    uint32_t DS         :1; // 21
    uint32_t ACPI       :1; // 22
    uint32_t MMX        :1; // 23
    uint32_t FXSR       :1; // 24
    uint32_t SSE        :1; // 25
    uint32_t SSE2       :1; // 26
    uint32_t SS         :1; // 27
    uint32_t HTT        :1; // 28
    uint32_t TM         :1; // 29
    uint32_t IA64       :1; // 30
    uint32_t PBE        :1; // 31
} cpuid_feat_edx;

#pragma pack(pop)

typedef enum Processor_Family_ID_Amd {
    Amd486         = 0x4,
    Amd5x86        = Amd486,
    Elan_SC4xx_5xx = Amd486,

    K5,
    K6             = K5,

    K7_Athlon,
    Athlon_XP      = K7_Athlon,

    K8_Hammer      = 0x0f,             // Athlon 64
    K10_Phenom     = 0x10,
    Turion_X2,
    Llano,

    Bobcat         = 0x14,
    Bulldozer,
    Piledriver     = Bulldozer,
    Steamroller    = Bulldozer,
    Excavator      = Bulldozer,

    Jaguar,
    Puma           = Jaguar,

    Zen1,
    Zen2           = Zen1, 
    Hygon_Dhyana,
    Zen3,
    Zen4           = Zen3,
    Zen5
} Processor_Family_ID_Amd;

typedef enum Processor_Family_ID_Intel {
    // El procesador i386 no admite la instrucción CPUID; sin embargo, devuelve 
    // el ID de familia 3h en el valor de reinicio de EDX.
    i486 = 0x4,

    Pentium,
    Pentium_MMX            = Pentium,
    Quark_X1000            = Pentium,
        
